Tekla.Structures.DrawingInternal.DatabaseObjectExtensions
Extension methods for class DatabaseObject.

Tekla.Structures.DrawingInternal.DatabaseObjectExtensions.GetIdentifier(Tekla.Structures.Drawing.DatabaseObject)
Returns the Identifier of the DatabaseObject.
databaseObject: The DatabaseObject to obtain the Identifier from.
Returns: The Identifier of the specified DatabaseObject.

Tekla.Structures.DrawingInternal.DatabaseObjectExtensions.GetViewIdentifier(Tekla.Structures.Drawing.DatabaseObject)
Returns the Identifier of the view containing the DatabaseObject.
databaseObject: The DatabaseObject to obtain the View Identifier from.
Returns: The Identifier of the View that contains the specified DatabaseObject.